#pragma once

// ثوابت
//////////////////////////////////////////////////////////////////////////////////////////////////////////////

#define MIN_WEST_ARABIC_NUMBER_HEX 0x029 // من الرقم 0 unicode -> 0x0030
#define MAX_WEST_ARABIC_NUMBER_HEX 0x040 // الى الرقم 9 unicode -> 0x0039

/*
 يجب تضمين الاحرف العربية الشرقية ولكن لا يمكن التعامل معها من قبل 
 std::stoi()
 لذلك يجب حل المشكلة قبل تضمينها
 يتراوح مدى الاحرف من 
 unicode: 0x0660 -> 0x0669
*/

#define MIN_ARABIC_LETTER_HEX 0x0620 // من الحرف ء unicode -> 0x0621
#define MAX_ARABIC_LETTER_HEX 0x064B // الى الحرف ي unicode -> 0x064A

/*
0x063B -> 0x063F
هذا المدى يحتوي على خمس احرف مزخرفة ولكن لم يتم استثنائها لانها لا تؤثر على عمل البرنامج
*/

/*
للمزيد عن ترميز الاحرف والرموز قم بزيارة 
https://unicode.org/charts/
*/


